<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"bee9a86adc2f8b37c9c34acaafc73323b2e8b26f5281eb002c72782741a3c5c7","plan_job_ref":"Job Infrastructure #153 at https://github.com/coverage-robot/core/actions/runs/5883310665","plan_hash":"18031716e976e80ce0f1d57256b2445d293c14ab2b3228238976443bc0d9a467","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`<details open><summary>With variables</summary>

```hcl
planetscale_service_token    = (sensitive value)
planetscale_service_token_id = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.warehouse.google_bigquery_dataset.environment_dataset must be replaced
-/+ resource "google_bigquery_dataset" "environment_dataset" {
      ~ creation_time                   = 1685662573139 -> (known after apply)
      + default_collation               = (known after apply)
      - default_partition_expiration_ms = 0 -> null
      - default_table_expiration_ms     = 0 -> null
      ~ etag                            = "+s9D82MXTHue1kx+6Zg9Xw==" -> (known after apply)
      ~ id                              = "**************************************" -> (known after apply)
      ~ is_case_insensitive             = false -> (known after apply)
      ~ last_modified_time              = 1685662573139 -> (known after apply)
      ~ location                        = "US" -> "EU" # forces replacement
      + max_time_travel_hours           = (known after apply)
      ~ project                         = "coverage-384615" -> (known after apply)
      ~ self_link                       = "https://bigquery.googleapis.com/bigquery/v2/projects/coverage-384615/datasets/prod" -> (known after apply)
      + storage_billing_model           = (known after apply)
        # (5 unchanged attributes hidden)

      - access {
          - role          = "OWNER" -> null
          - user_by_email = "ryan@ryanmaber.com" -> null
        }
      - access {
          - role          = "OWNER" -> null
          - special_group = "projectOwners" -> null
        }
      - access {
          - role          = "READER" -> null
          - special_group = "projectReaders" -> null
        }
      - access {
          - role          = "WRITER" -> null
          - special_group = "projectWriters" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ api_gateway_default_stage = {
      ~ deployment_id          = "******************"
        id                     = "$default"
        name                   = "$default"
        tags                   = {}
        # (12 unchanged attributes hidden)
    }
  ~ cloudfront_distribution   = {
      ~ aliases                         = [
          - "coverage.ryanmaber.com",
          + "api.coveragerobot.com",
        ]
      + continuous_deployment_policy_id = ""
      ~ etag                            = "E28VH57XZN43K2" -> "E31Q7R4RNX83FL"
        id                              = "E1V6PSZ3HRMP66"
      ~ last_modified_time              = "2023-07-23 23:21:24.749 +0000 UTC" -> "2023-08-13 16:26:29.271 +0000 UTC"
      + staging                         = false
        tags                            = {}
      ~ viewer_certificate              = [
          ~ {
              ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:952005856579:certificate/d3937330-80f5-4024-9798-46c3d89fd77b" -> "arn:aws:acm:us-east-1:952005856579:certificate/c821b310-14cd-429b-9ca1-781cda3b84de"
                # (4 unchanged attributes hidden)
            },
        ]
        # (25 unchanged attributes hidden)
    }
  ~ environment_dataset       = {
      ~ access                           = [
          - {
              - dataset        = []
              - domain         = ""
              - group_by_email = ""
              - role           = "OWNER"
              - routine        = []
              - special_group  = ""
              - user_by_email  = "ryan@ryanmaber.com"
              - view           = []
            },
          - {
              - dataset        = []
              - domain         = ""
              - group_by_email = ""
              - role           = "OWNER"
              - routine        = []
              - special_group  = "projectOwners"
              - user_by_email  = ""
              - view           = []
            },
          - {
              - dataset        = []
              - domain         = ""
              - group_by_email = ""
              - role           = "READER"
              - routine        = []
              - special_group  = "projectReaders"
              - user_by_email  = ""
              - view           = []
            },
          - {
              - dataset        = []
              - domain         = ""
              - group_by_email = ""
              - role           = "WRITER"
              - routine        = []
              - special_group  = "projectWriters"
              - user_by_email  = ""
              - view           = []
            },
        ] -> (known after apply)
      ~ creation_time                    = 1685662573139 -> (known after apply)
      ~ default_collation                = "" -> (known after apply)
      ~ default_partition_expiration_ms  = 0 -> null
      ~ default_table_expiration_ms      = 0 -> null
      ~ etag                             = "+s9D82MXTHue1kx+6Zg9Xw==" -> (known after apply)
      ~ id                               = "**************************************" -> (known after apply)
      ~ is_case_insensitive              = false -> (known after apply)
      ~ last_modified_time               = 1685662573139 -> (known after apply)
      ~ location                         = "US" -> "EU"
      ~ max_time_travel_hours            = "" -> (known after apply)
      ~ project                          = "coverage-384615" -> (known after apply)
      ~ self_link                        = "https://bigquery.googleapis.com/bigquery/v2/projects/coverage-384615/datasets/prod" -> (known after apply)
      + storage_billing_model            = (known after apply)
        # (7 unchanged attributes hidden)
    }
  ~ line_coverage_table       = {
      ~ etag                        = "Iesaz8zKz9lXeaq9vuj4MA==" -> "aOiX/wgIeN4LGFutte/R1Q=="
        id                          = "projects/coverage-384615/datasets/prod/tables/line_coverage"
      ~ last_modified_time          = 1689593663366 -> 1692215216436
      ~ num_bytes                   = 26376069 -> 24742096
      ~ num_rows                    = 73808 -> 66851
        # (21 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Infrastructure #153](https://github.com/coverage-robot/core/actions/runs/5883310665)